In [1]:
import pandas as pd
import numpy as np

**NaN: Missing Numerical Data**

In [2]:
vals2 = np.array([1, np.nan, 3, 4])

In [3]:
vals2

array([ 1., nan,  3.,  4.])

**Detecting Null Values**

In [4]:
data = pd.Series([1, np.nan, 'hello', None])

In [5]:
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

**Dropping Null Values**

In [6]:
data.dropna()

0        1
2    hello
dtype: object

In [9]:
df = pd.DataFrame([[1, np.nan, 2],
                   [2, 3, 5],
                   [np.nan, 4, 6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [10]:
df.dropna()

     0    1  2
1  2.0  3.0  5

In [11]:
df.dropna(axis="columns")

   2
0  2
1  5
2  6

In [12]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [13]:
df.dropna(axis="columns", how="all")

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

**Filling Null Values**

In [23]:
data = pd.DataFrame([[1, np.nan, 2, 3],
                     [2,3,np.nan, 3],
                      [1,2,3,np.nan]])

In [24]:
data

   0    1    2    3
0  1  NaN  2.0  3.0
1  2  3.0  NaN  3.0
2  1  2.0  3.0  NaN

In [25]:
data.fillna(0)

   0    1    2    3
0  1  0.0  2.0  3.0
1  2  3.0  0.0  3.0
2  1  2.0  3.0  0.0

In [26]:
df.fillna(method='ffill', axis=1)

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_15496\901808322.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill', axis=1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

In [27]:
pop_df = pop.unstack()

NameError: name 'pop' is not defined